# GreaterThanOrEqual Operator

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetId..::..GreaterThanOrEqual Operator
WorksetId Class See Also
---
Determines whether one WorksetId is not less than another WorksetId.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool operator >=(
	WorksetId WorksetId1,
	WorksetId WorksetId2
)
```

Visual Basic
---
```text
Public Shared Operator >= ( _
	WorksetId1 As WorksetId, _
	WorksetId2 As WorksetId _
) As Boolean
```

Visual C++
---
```text
public:
static bool operator >=(
	WorksetId^ WorksetId1,
	WorksetId^ WorksetId2
)
```

# ### Parameters
WorksetId1
    Type: Autodesk.Revit.DB..::..WorksetIdThe first WorksetId.
WorksetId2
    Type: Autodesk.Revit.DB..::..WorksetIdThe second WorksetId.
# ### Return Value
True if the first WorksetId is not less than the second WorksetId, otherwise, false.
# See Also
WorksetId Class
Autodesk.Revit.DB Namespace